Jorg8383/embedded-PIC18-weather_station/mcc_generated_files/pin_manager.h
/**
  @Generated Pin Manager Header File

  @Company:
    Microchip Technology Inc.

  @File Name:
    pin_manager.h

  @Summary:
    This is the Pin Manager file generated using PIC10 / PIC12 / PIC16 / PIC18 MCUs

  @Description
    This header file provides APIs for driver for .
    Generation Information :
        Product Revision  :  PIC10 / PIC12 / PIC16 / PIC18 MCUs - 1.81.8
        Device            :  PIC18F47Q10
        Driver Version    :  2.11
    The generated drivers are tested against the following:
        Compiler          :  XC8 2.36 and above
        MPLAB 	          :  MPLAB X 6.00	
*/

/*
    (c) 2018 Microchip Technology Inc. and its subsidiaries. 
    
    Subject to your compliance with these terms, you may use Microchip software and any 
    derivatives exclusively with Microchip products. It is your responsibility to comply with third party 
    license terms applicable to your use of third party software (including open source software) that 
    may accompany Microchip software.
    
    THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER 
    EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY 
    IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS 
    FOR A PARTICULAR PURPOSE.
    
    IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, 
    INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND 
    WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP 
    HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO 
    THE FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL 
    CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT 
    OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS 
    SOFTWARE.
*/

#ifndef PIN_MANAGER_H
#define PIN_MANAGER_H

/**
  Section: Included Files
*/

#include <xc.h>

#define INPUT   1
#define OUTPUT  0

#define HIGH    1
#define LOW     0

#define ANALOG      1
#define DIGITAL     0

#define PULL_UP_ENABLED      1
#define PULL_UP_DISABLED     0

// get/set RA0_POT aliases
#define RA0_POT_TRIS                 TRISAbits.TRISA0
#define RA0_POT_LAT                  LATAbits.LATA0
#define RA0_POT_PORT                 PORTAbits.RA0
#define RA0_POT_WPU                  WPUAbits.WPUA0
#define RA0_POT_OD                   ODCONAbits.ODCA0
#define RA0_POT_ANS                  ANSELAbits.ANSELA0
#define RA0_POT_SetHigh()            do { LATAbits.LATA0 = 1; } while(0)
#define RA0_POT_SetLow()             do { LATAbits.LATA0 = 0; } while(0)
#define RA0_POT_Toggle()             do { LATAbits.LATA0 = ~LATAbits.LATA0; } while(0)
#define RA0_POT_GetValue()           PORTAbits.RA0
#define RA0_POT_SetDigitalInput()    do { TRISAbits.TRISA0 = 1; } while(0)
#define RA0_POT_SetDigitalOutput()   do { TRISAbits.TRISA0 = 0; } while(0)
#define RA0_POT_SetPullup()          do { WPUAbits.WPUA0 = 1; } while(0)
#define RA0_POT_ResetPullup()        do { WPUAbits.WPUA0 = 0; } while(0)
#define RA0_POT_SetPushPull()        do { ODCONAbits.ODCA0 = 0; } while(0)
#define RA0_POT_SetOpenDrain()       do { ODCONAbits.ODCA0 = 1; } while(0)
#define RA0_POT_SetAnalogMode()      do { ANSELAbits.ANSELA0 = 1; } while(0)
#define RA0_POT_SetDigitalMode()     do { ANSELAbits.ANSELA0 = 0; } while(0)

// get/set RC6 procedures
#define RC6_SetHigh()            do { LATCbits.LATC6 = 1; } while(0)
#define RC6_SetLow()             do { LATCbits.LATC6 = 0; } while(0)
#define RC6_Toggle()             do { LATCbits.LATC6 = ~LATCbits.LATC6; } while(0)
#define RC6_GetValue()              PORTCbits.RC6
#define RC6_SetDigitalInput()    do { TRISCbits.TRISC6 = 1; } while(0)
#define RC6_SetDigitalOutput()   do { TRISCbits.TRISC6 = 0; } while(0)
#define RC6_SetPullup()             do { WPUCbits.WPUC6 = 1; } while(0)
#define RC6_ResetPullup()           do { WPUCbits.WPUC6 = 0; } while(0)
#define RC6_SetAnalogMode()         do { ANSELCbits.ANSELC6 = 1; } while(0)
#define RC6_SetDigitalMode()        do { ANSELCbits.ANSELC6 = 0; } while(0)

// get/set RC7 procedures
#define RC7_SetHigh()            do { LATCbits.LATC7 = 1; } while(0)
#define RC7_SetLow()             do { LATCbits.LATC7 = 0; } while(0)
#define RC7_Toggle()             do { LATCbits.LATC7 = ~LATCbits.LATC7; } while(0)
#define RC7_GetValue()              PORTCbits.RC7
#define RC7_SetDigitalInput()    do { TRISCbits.TRISC7 = 1; } while(0)
#define RC7_SetDigitalOutput()   do { TRISCbits.TRISC7 = 0; } while(0)
#define RC7_SetPullup()             do { WPUCbits.WPUC7 = 1; } while(0)
#define RC7_ResetPullup()           do { WPUCbits.WPUC7 = 0; } while(0)
#define RC7_SetAnalogMode()         do { ANSELCbits.ANSELC7 = 1; } while(0)
#define RC7_SetDigitalMode()        do { ANSELCbits.ANSELC7 = 0; } while(0)

// get/set RD0_LCD_BACKLIGHT aliases
#define RD0_LCD_BACKLIGHT_TRIS                 TRISDbits.TRISD0
#define RD0_LCD_BACKLIGHT_LAT                  LATDbits.LATD0
#define RD0_LCD_BACKLIGHT_PORT                 PORTDbits.RD0
#define RD0_LCD_BACKLIGHT_WPU                  WPUDbits.WPUD0
#define RD0_LCD_BACKLIGHT_OD                   ODCONDbits.ODCD0
#define RD0_LCD_BACKLIGHT_ANS                  ANSELDbits.ANSELD0
#define RD0_LCD_BACKLIGHT_SetHigh()            do { LATDbits.LATD0 = 1; } while(0)
#define RD0_LCD_BACKLIGHT_SetLow()             do { LATDbits.LATD0 = 0; } while(0)
#define RD0_LCD_BACKLIGHT_Toggle()             do { LATDbits.LATD0 = ~LATDbits.LATD0; } while(0)
#define RD0_LCD_BACKLIGHT_GetValue()           PORTDbits.RD0
#define RD0_LCD_BACKLIGHT_SetDigitalInput()    do { TRISDbits.TRISD0 = 1; } while(0)
#define RD0_LCD_BACKLIGHT_SetDigitalOutput()   do { TRISDbits.TRISD0 = 0; } while(0)
#define RD0_LCD_BACKLIGHT_SetPullup()          do { WPUDbits.WPUD0 = 1; } while(0)
#define RD0_LCD_BACKLIGHT_ResetPullup()        do { WPUDbits.WPUD0 = 0; } while(0)
#define RD0_LCD_BACKLIGHT_SetPushPull()        do { ODCONDbits.ODCD0 = 0; } while(0)
#define RD0_LCD_BACKLIGHT_SetOpenDrain()       do { ODCONDbits.ODCD0 = 1; } while(0)
#define RD0_LCD_BACKLIGHT_SetAnalogMode()      do { ANSELDbits.ANSELD0 = 1; } while(0)
#define RD0_LCD_BACKLIGHT_SetDigitalMode()     do { ANSELDbits.ANSELD0 = 0; } while(0)

/**
   @Param
    none
   @Returns
    none
   @Description
    GPIO and peripheral I/O initialization
   @Example
    PIN_MANAGER_Initialize();
 */
void PIN_MANAGER_Initialize (void);

/**
 * @Param
    none
 * @Returns
    none
 * @Description
    Interrupt on Change Handling routine
 * @Example
    PIN_MANAGER_IOC();
 */
void PIN_MANAGER_IOC(void);



#endif // PIN_MANAGER_H
/**
 End of File
*/